#!/usr/bin/env python3
# -*- coding: utf-8 -*-

from typing import Dict, Optional


# Таблица служебных слов (Таблица 1.2)
KEYWORDS: Dict[str, int] = {
    'DCL': 2,
    'END': 3,
    'FUNCTION': 4,
    'GOTO': 5,
    'IF': 6,
    'PROC': 7,
    'THEN': 8,
    'MAIN': 9,
    'ELSE': 10,
    'WHILE': 11,
    'DO': 12,
}

# Таблица операций (Таблица 1.3)
OPERATORS: Dict[str, int] = {
    '+': 1,
    '*': 2,
    '<': 3,
    '>': 4,
    '=': 5,
    ':': 6,
    '<>': 7,
    '-': 8,
    '/': 9,
    '<=': 10,
    '>=': 11,
    '==': 12,
    '!=': 13,
    '&&': 14,
    '||': 15,
    '!': 16,
    '<-' : 17
}

# Таблица разделителей (Таблица 1.4)
DELIMITERS: Dict[str, int] = {
    ' ': 1,
    ',': 2,
    ';': 3,
    '(': 4,
    ')': 5,
    '.': 6,
    '\n': 7,
    '{': 8,
    '}': 9,
    '[': 10,
    ']': 11,
}